[
    "Avatar Options",
    "Show All Avatar Performance Details",
    "Multiple pipelines are present. V3 pipeline will take priority",
    "A VRCSceneDescriptor or VRCAvatarDescriptor\nis required to build VRChat SDK Content",
    "Building – Please Wait ...",
    "This avatar uses Visemes but the Face Mesh is not specified.",
    "A Material on this avatar has custom shader keywords. Please consider optimizing it using the Shader Keywords Utility.",
    "This avatar does not contain an Animator, and will not animate in VRChat",
    "This avatar is not imported as a humanoid rig and will not play VRChat's provided animation set.",
    "Your avatar is disabled in the scene hierarchy!",
    "Your avatar is humanoid, but its feet aren't specified!",
    "Avatar feet are beneath the avatar's origin (the floor). That's probably not what you want.",
    "Your avatar is humanoid, but its upper arms aren't specified!",
    "This avatar is too short. The minimum is 20cm shoulder height.",
    "This avatar is shorter than average.",
    "This avatar is too tall. The maximum is 5m shoulder height.",
    "This avatar is taller than average.",
    "See Avatar Rig Requirements for more information.",
    "This avatar does not have a humanoid rig, so it can not be used as a custom fallback.",
    "This avatar does not have an overall rating of Good or better, so it can not be used as a custom fallback. See the link below for details on Avatar Optimization.",
    "This avatar can be used as a custom fallback. This avatar must be uploaded for every supported platform to be valid for fallback selection.",
    "This avatar uses additional animators, they will be disabled when used as a fallback.",
    "This avatar will be blocked by default due to performance. Your fallback will be shown instead.",
    "Other users may choose to block this avatar due to performance. Your fallback will be shown instead.",
    "Gesture Layer needs valid mask on first animator layer",
    "Images used for Actions & Moods are too large.",
    "VRCExpressionsMenu object reference is missing.",
    "VRCExpressionParameters object reference is missing.",
    "VRCExpressionParameters has too many parameters defined.",
    "VRCExpressionsMenu uses a parameter that is not defined.\nParameter: ",
    "VRCExpressionsMenu uses an invalid parameter for a control.\nControl: ",
    "This avatar uses depreciated DynamicBone components. Upgrade to PhysBones to guarantee future compatibility.",
    "The following component types are found on the Avatar and will be removed by the client: ",
    "Audio sources found on Avatar, they will be adjusted to safe limits, if necessary.",
    "Found an audio clip with load type `Decompress On Load` which doesn't have `Load In Background` enabled.\nPlease enable `Load In Background` on the audio clip.",
    "Stations found on Avatar, they will be adjusted to safe limits, if necessary.",
    "This avatar has one or more Substance materials, which is not supported and may break in-game. Please bake your Substances to regular materials.",
    "Avatar uses unsupported shader '",
    "'. You can only use the shaders provided in 'VRChat/Mobile' for Quest avatars.",
    "Unknown performance display level.",
    "Add a VRCAvatarDescriptor",
    "Adds a VRCAvatarDescriptor to the selected GameObject",
    "A VRCAvatarDescriptor is required to build a VRChat Avatar",
    ".\nSelect a GameObject to add a VRCAvatarDescriptor to it.",
    "This avatar cannot be used as a fallback. Check Validations below for more info",
    "This avatar can be used as a fallback. Check Validations below for more info.",
    "This avatar can be used as a fallback. Switch to the Android platform to select it.",
    "This avatar is currently set as your fallback",
    "name",
    "Give your avatar a name",
    "thumbnail",
    "Select a thumbnail image",
    "build",
    "Click \"Build & Publish\"",
    "Saving Avatar Changes...",
    "Updating avatar",
    "You must fix the issues listed above before you can do an Offline Test",
    "You must accept the terms above to upload content to VRChat",
    "Please set a name and thumbnail before uploading",
    "You must fix the issues listed above before you can Upload a Build",
    "Build was blocked by the SDK callback",
    "Current User does not have permissions to build avatars",
    "Open the SDK panel to build and upload avatars",
    "Avatar testing is only supported on Windows",
    "Avatar build finished",
    "Building Avatar",
    "Build Failed",
    "Upload Succeeded!",
    "Upload Failed",
    "Build Succeeded!",
    "Failed to find the built avatar bundle, the build likely failed",
    "Target avatar does not have a PipelineManager, make sure a PipelineManager component is present before uploading",
    "You must provide a path to the thumbnail image when creating a new avatar",
    "Avatar's current ID belongs to a different user, assign a different ID",
    "A VRCSceneDescriptor or VRCAvatarDescriptor\nis required to build VRChat SDK Content",
    "This avatar does not contain an Animator, and will not animate in VRChat.",
    "VRCExpressionsMenu uses a parameter that is not defined.\nParameter: ",
    "VRCExpressionsMenu uses an invalid parameter for a control.\nControl: ",
    "Found an audio clip with load type `Decompress On Load` which doesn't have `Load In Background` enabled.\nPlease enable `Load In Background` on the audio clip.",
    "Avatar Optimization Tips",
    "Set this avatar as fallback",
    "No PipelineManager found on the avatar, make sure you added an Avatar Descriptor",
    "Updated avatar",
    "Building and testing on this platform is not supported.",
    "Avatar Built",
    "This avatar does not have a PipelineManager",
    "Encountered the following validation issues during build:",
    "Failed to build avatar!",
    "Failed to upload avatar!",
    "Avatar is too large for the target platform.",
    "Assigning a new ID",
    "Request cancelled",
    "Avatar upload finished",
    "Avatar upload canceled",
    "Custom cancellation token passed, you should cancel via its token source instead",
    "Avatar validation failed",
    "This avatar has mipmapped textures without 'Streaming Mip Maps' enabled.",
    "Set Mip Map Streaming",
    "Humanoid avatar must have head, hands and feet bones mapped.",
    "Spine hierarchy missing elements, please map: ",
    "Spine hierarchy incorrect. Make sure that the parent of both Shoulders and the Neck is the Chest (or UpperChest if set).",
    "LowerArm is not first child of UpperArm or Hand is not first child of LowerArm: you may have problems with Forearm rotations.",
    "LowerLeg is not first child of UpperLeg or Foot is not first child of LowerLeg: you may have problems with Shin rotations.",
    "This avatar has a split hierarchy (Hips bone is not the ancestor of all humanoid bones). IK may not work correctly.",
    "Could not check for legacy blend shape normals because 'legacyComputeAllNormalsFromSmoothingGroupsWhenMeshHasBlendShapes' was not found.",
    "This avatar contains skinned meshes that were imported with Blendshape Normals set to 'Calculate' but aren't using 'Legacy Blendshape Normals'. This will significantly increase the size of the uploaded avatar. This must be fixed in the mesh import settings before uploading.",
    "This avatar contains meshes that were imported with Read/Write disabled. This must be fixed in the mesh import settings before uploading.",
    "Click \"Build & Publish\""
]